servo/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user&.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "phone_number", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"