backend/app/views/api/vendors/index.json.jbuilder

SELECT "services".* FROM "services" WHERE "services"."vendor_id" = $1  [["vendor_id", 1]]
SELECT "vendors".* FROM "vendors"
---
        json.extract! address, :longitude, :latitude, :address
        json.services vendor.services.map(&:id)
        json.calendar vendor.vendor_calendar.id if vendor.vendor_calendar.present?