backend/app/views/api/restaurants/index.json.jbuilder

        json.extract! @address, :longitude, :latitude, :address
        json.menuItems restaurant.menu_items.map(&:id)
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."restaurant_id" = $1  [["restaurant_id", 2]]