backend/app/controllers/api/cart_items_controller.rb

INSERT INTO "cart_items" ("user_id", "service_id", "created_at", "updated_at", "options", "price", "address_id", "vendor_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @cart_item = CartItem.new(cart_item_params)
        if @cart_item.save

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]
---
    def destroy
        @cart_item = CartItem.find(params[:id])
        if @cart_item && @cart_item.destroy