backend/app/controllers/api/images_controller.rb

    def index
        @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]