backend/app/controllers/api/images_controller.rb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def index
        @vendor = Vendor.find(params[:vendor_id])