backend/app/controllers/api/reviews_controller.rb

    def index
        @vendor = Vendor.find(params[:vendor_id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]