backend/app/controllers/api/vendors_controller.rb

    def index
        @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors"

    def show
        @vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]