app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
        loop do
            session_token = SecureRandom.urlsafe_base64
            unless User.find_by(session_token: session_token)