backend/app/views/api/services/index.json.jbuilder

SELECT "inputs".* FROM "inputs" WHERE "inputs"."service_id" = $1  [["service_id", 4]]
---
        json.inputs do
            service.inputs.each do |input|

SELECT "options".* FROM "options" WHERE "options"."input_id" = $1  [["input_id", 22]]
---
                    json.options do
                        input.options.each do |option|